// Задание 17: Объявите и вызовите функцию `print`, которая принимает строку
// выводит её на консоль.

#include <iostream>
using namespace std;

void print(string message)
{
    cout << message;
}

int main()
{
    print("Hello, World!");
    return 0;
}